import React from 'react'
import 'bootstrap/dist/css/bootstrap.min.css'

const Privacy = () => {
  return (
    <div className="container my-5">
      <div className="card p-4">
        <div className="mb-3 fw-bold">Політика конфіденційності</div>
        <div className="mb-2 fw-bold">1. Загальні положення</div>
        <p>
          Асоціація власників інтернет-магазинів (далі &ndash;
          &quot;Асоціація&quot;) поважає право кожного користувача на
          конфіденційність. Ця Політика конфіденційності пояснює, які дані ми
          збираємо, як їх використовуємо та захищаємо.
        </p>
        <div className="mb-2 fw-bold">2. Які дані ми збираємо</div>
        <p>Ми можемо збирати наступну інформацію:</p>
        <ul>
          <li>Персональні дані: ім&apos;я, прізвище, номер телефону.</li>
          <li>Технічні дані: IP-адреса, тип браузера, час доступу.</li>
          <li>
            Дані, надані користувачами: повідомлення, запити через форми
            зворотного зв&rsquo;язку.
          </li>
        </ul>
        <div className="mb-2 fw-bold">3. Як ми використовуємо ваші дані</div>
        <p>Ми використовуємо зібрану інформацію для:</p>
        <ul>
          <li>Надання безкоштовних консультацій та підтримки.</li>
          <li>Поліпшення роботи сайту та персоналізації контенту.</li>
          <li>Надсилання інформаційних розсилок (за згодою користувача).</li>
          <li>Відповіді на запити користувачів.</li>
        </ul>
        <div className="mb-2 fw-bold">4. Захист персональних даних</div>
        <p>
          Ми вживаємо всіх необхідних заходів для захисту персональних даних від
          несанкціонованого доступу, зміни, розголошення або знищення.
        </p>
        <div className="mb-2 fw-bold">5. Передача даних третім сторонам</div>
        <p>
          Ми не передаємо ваші персональні дані третім особам без вашої згоди,
          за винятком випадків, передбачених законом.
        </p>
        <div className="mb-2 fw-bold">6. Файли &quot;cookie&quot;</div>
        <p>
          Ми використовуємо файли &quot;cookie&quot; для покращення взаємодії
          користувачів із сайтом. Ви можете налаштувати використання файлів
          &quot;cookie&quot; у своєму браузері.
        </p>
        <div className="mb-2 fw-bold">7. Ваші права</div>
        <p>Ви маєте право:</p>
        <ul>
          <li>Отримати доступ до своїх персональних даних.</li>
          <li>Вимагати їх виправлення або видалення.</li>
          <li>Відкликати згоду на їх обробку.</li>
        </ul>
        <div className="mb-2 fw-bold">8. Контактна інформація</div>
        <p>
          Якщо у вас є питання щодо цієї Політики конфіденційності, ви можете
          зв&rsquo;язатися з нами:
        </p>
        <p>
          📩 Email: info@aoso.org.ua <br />
          📞 Телефон: +380967859865
        </p>
        <div className="mb-2 fw-bold">
          9. Зміни до Політики конфіденційності
        </div>
        <p>
          Ми залишаємо за собою право змінювати цю Політику конфіденційності.
          Актуальна версія буде доступна на цій сторінці.
        </p>
        <p>
          Користуючись нашим сайтом, ви погоджуєтеся з цією Політикою
          конфіденційності.
        </p>
      </div>
    </div>
  )
}

export default Privacy
